src/cf/Catalogs/уатПричиныЗакрытияЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатПричиныЗакрытияЗаказов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВМобильномПриложении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытУспешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатПричиныЗакрытияЗаказов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника.
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	// Обновление предопределенного элемента "ЗакрытУспешно".
	СправочникОбъект = Справочники.уатПричиныЗакрытияЗаказов.ЗакрытУспешно.ПолучитьОбъект();
	СправочникОбъект.ИспользоватьВМобильномПриложении = Истина;
	СправочникОбъект.ЗакрытУспешно = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
	// Обновление предопределенного элемента "Отклонен".
	СправочникОбъект = Справочники.уатПричиныЗакрытияЗаказов.Отклонен.ПолучитьОбъект();
	СправочникОбъект.ИспользоватьВМобильномПриложении = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
